Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF4585.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF9EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF9EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD72">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF9EID8" edc:desc="" edc:mask="0x1" edc:name="RXF9EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF9EID9" edc:desc="" edc:mask="0x1" edc:name="RXF9EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF9EID10" edc:desc="" edc:mask="0x1" edc:name="RXF9EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF9EID11" edc:desc="" edc:mask="0x1" edc:name="RXF9EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF9EID12" edc:desc="" edc:mask="0x1" edc:name="RXF9EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF9EID13" edc:desc="" edc:mask="0x1" edc:name="RXF9EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF9EID14" edc:desc="" edc:mask="0x1" edc:name="RXF9EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF9EID15" edc:desc="" edc:mask="0x1" edc:name="RXF9EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF9EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF9EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD73">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF9EID0" edc:desc="" edc:mask="0x1" edc:name="RXF9EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF9EID1" edc:desc="" edc:mask="0x1" edc:name="RXF9EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF9EID2" edc:desc="" edc:mask="0x1" edc:name="RXF9EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF9EID3" edc:desc="" edc:mask="0x1" edc:name="RXF9EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF9EID4" edc:desc="" edc:mask="0x1" edc:name="RXF9EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF9EID5" edc:desc="" edc:mask="0x1" edc:name="RXF9EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF9EID6" edc:desc="" edc:mask="0x1" edc:name="RXF9EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF9EID7" edc:desc="" edc:mask="0x1" edc:name="RXF9EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF10SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF10SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD74">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF10SID3" edc:desc="" edc:mask="0x1" edc:name="RXF10SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF10SID4" edc:desc="" edc:mask="0x1" edc:name="RXF10SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF10SID5" edc:desc="" edc:mask="0x1" edc:name="RXF10SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF10SID6" edc:desc="" edc:mask="0x1" edc:name="RXF10SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF10SID7" edc:desc="" edc:mask="0x1" edc:name="RXF10SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF10SID8" edc:desc="" edc:mask="0x1" edc:name="RXF10SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF10SID9" edc:desc="" edc:mask="0x1" edc:name="RXF10SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF10SID10" edc:desc="" edc:mask="0x1" edc:name="RXF10SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnn-n-nn" edc:cname="RXF10SIDL" edc:desc="" edc:impl="0xeb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuu-u-uu" edc:name="RXF10SIDL" edc:nzwidth="0x8" edc:por="xxx-x-xx" edc:_addr="0xD75">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDEN" edc:desc="" edc:mask="0x1" edc:name="EXIDEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="EXIDE" edc:desc="" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF10EID16" edc:desc="" edc:mask="0x1" edc:name="RXF10EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF10EID17" edc:desc="" edc:mask="0x1" edc:name="RXF10EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF10EXIDEN" edc:desc="" edc:mask="0x1" edc:name="RXF10EXIDEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF10SID0" edc:desc="" edc:mask="0x1" edc:name="RXF10SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF10SID1" edc:desc="" edc:mask="0x1" edc:name="RXF10SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF10SID2" edc:desc="" edc:mask="0x1" edc:name="RXF10SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
